[
  {
    "hash": "4c6dc12",
    "tag": "0.0.27",
    "date": "4 minutes ago",
    "message": "Update references to point to new ComfyUI Repo location"
  },
  {
    "hash": "bb603bb",
    "tag": "0.0.26",
    "date": "11 hours ago",
    "message": "Fix bug when installing custom node packages that require models to be downloaded from huggingface"
  },
  {
    "hash": "78757ec",
    "tag": "0.0.25",
    "date": "35 hours ago",
    "message": "Correct Desktop & Start Menu Icon not showing correctly."
  },
  {
    "hash": "c7b15c8",
    "tag": "0.0.24",
    "date": "35 hours ago",
    "message": "Fix strange git state"
  },
  {
    "hash": "7265609",
    "tag": null,
    "date": "35 hours ago",
    "message": "Fix strange git state. No feature updates."
  },
  {
    "hash": "0dd5178",
    "tag": "0.0.23",
    "date": "2 days ago",
    "message": "Add desktop shortcuts and icon copying for Nuvu-ComfyUI installation scripts; remove VRAM checks from workflow components"
  },
  {
    "hash": "d58bf2d",
    "tag": "0.0.22",
    "date": "10 days ago",
    "message": "Increase reliability of system VRAM check for whether a workflow can be run on a user's machine."
  },
  {
    "hash": "0f6ed82",
    "tag": null,
    "date": "10 days ago",
    "message": "Add estimate of if user's hardware can run a workflow that they are installing."
  },
  {
    "hash": "b485600",
    "tag": null,
    "date": "10 days ago",
    "message": "Ensure process finishes when downloading multiple models on \"Models\" tab."
  },
  {
    "hash": "d19ff21",
    "tag": "0.0.21",
    "date": "11 days ago",
    "message": "Refactor build_cython.py and setup.py to dynamically discover Python files for compilation, excluding __init__.py files. This improves maintainability by automating file management."
  },
  {
    "hash": "4f6cb8b",
    "tag": "0.0.20",
    "date": "12 days ago",
    "message": "Add system optimization for better user experience"
  },
  {
    "hash": "48c67a1",
    "tag": "0.0.18",
    "date": "2 weeks ago",
    "message": "REAME syntax corrections, no Nuvu Plugin Chagnes."
  },
  {
    "hash": "9559a8c",
    "tag": null,
    "date": "2 weeks ago",
    "message": "Cleanup model files on failed downloads to avoid corrupted files breaking workflows."
  },
  {
    "hash": "67290b9",
    "tag": null,
    "date": "2 weeks ago",
    "message": "Refactor CSS and JavaScript files for improved structure and readability. Update comfyui-nuvu.css for consistent styling and enhance nuvu.js by cleaning up imports and optimizing code structure."
  },
  {
    "hash": "99f03aa",
    "tag": "0.0.17",
    "date": "2 weeks ago",
    "message": "Improve messaging when user's device is not registered, and allow analyzing a new workflow without having to refresh the page"
  },
  {
    "hash": "9c7cedc",
    "tag": "0.0.16",
    "date": "2 weeks ago",
    "message": "Adjust logo paths to avoid unrendered logos"
  },
  {
    "hash": "db37708",
    "tag": "0.0.15",
    "date": "2 weeks ago",
    "message": "Update .gitignore to exclude log files and enhance GitHub Actions workflow to prevent log files from being uploaded. Clean up potential log files during build process for improved artifact management."
  },
  {
    "hash": "b71d6ab",
    "tag": "0.0.14",
    "date": "2 weeks ago",
    "message": "Merge: Accept incoming changes - restructure to src-frontend"
  },
  {
    "hash": "a712092",
    "tag": "0.0.13",
    "date": "2 weeks ago",
    "message": "Enhance Vite configuration to suppress specific warnings related to import.meta.url and adjust asset file naming for CSS. Update dialog.js to ensure correct base URL handling after bundling, and modify nuvu.js to reflect changes in module structure. Remove obsolete JavaScript files to streamline the codebase."
  },
  {
    "hash": "c9cbc03",
    "tag": "0.0.12",
    "date": "3 weeks ago",
    "message": "Update Vite configuration to improve build output structure and reserved names. Change output directory to 'dist' and adjust library entry points for better organization. Enhance reserved strings and names for ComfyUI integration. Update GitHub Actions workflow to reflect changes in build process and output paths. Modify extension path handling in JavaScript files to ensure compatibility with Vite's ignore feature."
  },
  {
    "hash": "7739b9e",
    "tag": "0.0.11",
    "date": "3 weeks ago",
    "message": "Update README.md to replace logo image with a new design. Enhance changelog retrieval by implementing separate handling for Nuvu and ComfyUI repositories, improving error handling, and adding remote fetching capabilities for commit history. This update streamlines the process of obtaining the latest commit information for both repository types."
  },
  {
    "hash": "4603c61",
    "tag": "0.0.10",
    "date": "3 weeks ago",
    "message": "Refactor OptimizerPanel.vue and Sidebar.vue for improved button structure and update website URL. Clean up ChangelogModal.vue by removing unnecessary whitespace. Enhance version detection in nuvu_server.py with better error handling and formatting. Remove obsolete JavaScript files and update import paths in nuvu.js to reflect recent changes."
  },
  {
    "hash": "5a6d612",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Update installation scripts and documentation to reflect repository name change from nuvu-Compiled to ComfyUI-Nuvu. Modify relevant paths and messages in linux_install_nuvu_comfyui.sh, windows_install_nuvu_comfyui.bat, and README.md for consistency. Adjust Docker entrypoint script to use the new repository name and ensure proper installation of custom nodes."
  },
  {
    "hash": "e9d64d8",
    "tag": "0.0.9",
    "date": "3 weeks ago",
    "message": "Enhance changelog retrieval in nuvu_server.py by detecting the current git branch before fetching commit history. Update command to prioritize remote tracking branches, improving version detection accuracy. This change streamlines the process of obtaining the latest commit information for better frontend integration."
  },
  {
    "hash": "3d8737c",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Enhance version tracking in OptimizerPanel.vue and ChangelogModal.vue by adding hash information for Nuvu and ComfyUI components. Update changelog links to prioritize hash values for better accuracy. Modify nuvu_server.py to retrieve and store commit hashes alongside tags for improved version detection. Remove obsolete JavaScript files and update import paths in nuvu.js to reflect recent changes."
  },
  {
    "hash": "8f87b08",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Remove obsolete JavaScript files: auth-pil8uz3l.js and main-BYFDc9sq.js. Update import paths in nuvu.js to reflect changes in module structure."
  },
  {
    "hash": "7368dea",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Refactor version detection logic in ChangelogModal.vue to improve accuracy. Enhance matching criteria for current version by prioritizing hash checks, followed by tag comparisons, and fallback to short hash checks. Clean up version strings for consistent comparison."
  },
  {
    "hash": "e686a07",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Update changelog retrieval logic in nuvu_server.py to fetch the last 100 commits and improve version detection in the frontend. Enhance OptimizerPanel.vue and ChangelogModal.vue to display current version indicators and update changelog links. Remove obsolete JavaScript files and ensure consistent styling in the changelog modal."
  },
  {
    "hash": "4f49af9",
    "tag": "0.0.8",
    "date": "3 weeks ago",
    "message": "Refactor version detection in nuvu_server.py to streamline fallback logic for backend version retrieval. Ensure accurate detection of installed versions using pip commands and improve error handling. Remove redundant checks and enhance clarity in version assignment for both backend and frontend components."
  },
  {
    "hash": "c0100b1",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Refactor version detection logic in nuvu_server.py to improve accuracy. Implement checks for installed backend version and fallback mechanisms using pip and changelog.json. Enhance frontend version retrieval by detecting git tags and reading from changelog.json if necessary. Update handling of version defaults for better reliability."
  },
  {
    "hash": "8497a22",
    "tag": "0.0.7",
    "date": "3 weeks ago",
    "message": "Implement changelog generation in CI workflow and integrate changelog modal in the dashboard. Add API endpoint to fetch changelog data from changelog.json or git log. Update frontend components to display changelog links and modal for Nuvu and ComfyUI updates."
  },
  {
    "hash": "26fb88f",
    "tag": "0.0.6",
    "date": "3 weeks ago",
    "message": "Enhance Windows installation script by adding a configurable port for ComfyUI and updating the helper launcher to use this port. Standardize capitalization of 'Nuvu' across various frontend components and backend logging for consistency. Remove obsolete JavaScript files from the Vue directory."
  },
  {
    "hash": "359b893",
    "tag": "0.0.5",
    "date": "3 weeks ago",
    "message": "Update batch scripts to include '--no-warn-script-location' flag for pip installations, enhancing compatibility and reducing warnings. Standardize capitalization of 'Nuvu' in various components for consistency across the application."
  },
  {
    "hash": "ab3b724",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Standardize capitalization of 'Nuvu' across various components and files, including loading messages and system info displays. Update references in the backend to ensure consistency in directory naming and logging. Handle user cancellation in installation processes gracefully."
  },
  {
    "hash": "c569550",
    "tag": "0.0.4",
    "date": "3 weeks ago",
    "message": "Merge branch 'stg'"
  },
  {
    "hash": "f57caca",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Update batch script and CI workflow to reflect renaming of 'nuvu-Compiled' to 'ComfyUI-Nuvu' and include 'windows_install_portable_nuvu.bat' in the build process."
  },
  {
    "hash": "15d004f",
    "tag": "0.0.3",
    "date": "3 weeks ago",
    "message": "Merge branch 'stg'"
  },
  {
    "hash": "e1e2182",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Standardize method names in dialog.js for Nuvu app integration, changing 'isnuvuAppMounted', 'mountnuvuApp', and 'setnuvuView' to 'isNuvuAppMounted', 'mountNuvuApp', and 'setNuvuView' for consistency."
  },
  {
    "hash": "05bd561",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Update import path in nuvu.js to reflect changes in main.js, switching from 'main-DEw3n8uv.js' to 'main-CAKph1xX.js' for consistency with recent refactoring."
  },
  {
    "hash": "2c73579",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Standardize method name in main.js by changing 'setnuvuAuthenticated' to 'setNuvuAuthenticated' for consistency with Nuvu app integration naming conventions."
  },
  {
    "hash": "8d57e5d",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Standardize method names in main.js and dialog.js for Nuvu app integration, changing 'mountnuvuApp', 'unmountnuvuApp', 'isnuvuAppMounted', 'getnuvuAppRef', and 'setnuvuView' to 'mountNuvuApp', 'unmountNuvuApp', 'isNuvuAppMounted', 'getNuvuAppRef', and 'setNuvuView', respectively. Update import statements in nuvu.js to reflect these changes."
  },
  {
    "hash": "433d4de",
    "tag": "0.0.2",
    "date": "3 weeks ago",
    "message": "Update repository references from TheArtOfficial to nuvulabs across all files, including installation scripts, documentation, and Docker configurations."
  },
  {
    "hash": "a97faa1",
    "tag": "0.0.1",
    "date": "3 weeks ago",
    "message": "Refactor dialog.js to standardize method names for Nuvu app integration, changing 'isNuvuAppMounted' and 'mountNuvuApp' to 'isnuvuAppMounted' and 'mountnuvuApp', respectively."
  },
  {
    "hash": "3213113",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Rename ComfyUI-Nitra to ComfyUI-Nuvu across all files and update related documentation. Remove obsolete Nitra files and adjust logging messages accordingly."
  },
  {
    "hash": "96380c3",
    "tag": null,
    "date": "3 weeks ago",
    "message": "Initial Commit from ArtOfficial gh transition"
  }
]